{
  "left-panel":
    {
      "bgImg": "https://source.unsplash.com/random/1200x4800",
      "bgImgAlt": "Random UnSplash Img",
      "headerLink": "/apollo",
      "siteSection": "The Design of Apollo",
      "pageTitle": "Changing Data",
      "pageSummary": "Maintaining balance and focus in data-heavy interfaces.",
      "prevLink": "/apollo/experiences",
      "prevPage": "Experience Models",
      "nextLink": "../destroying",
      "nextPage": "Destroying Data"
    },
  "detailed-content-header" :
    {
      "headline": "Changing Data",
      "tagline": "Dealing with user input",
      "summary": "When the user needs to change data or input new data, the ideal interface is sophisticated as necessary, and no more. With Apollo, we balance the the needs of the user with the needs of the data, and bring focus to the elements which require attention.<br><br>
        Creating new data, and editing existing data, are two aspects of the same action. As much as possible, the user experience should be consistent. These actions generally fall into two categories: <em>convenient</em>, and <em>disclosed</em>.",
      "headerImg": "https://source.unsplash.com/random/219x325",
      "headerImgAlt": "Random Unsplash Img",
      "contentList": [
        {
          "id": "convenientInput",
          "name": "Convenient Input"
        },
        {
          "id": "disclosedInput",
          "name": "Disclosed Input"
        }
      ]
    },
  "convenient-input":
    {
      "id": "convenientInput",
      "title": "Convenient Input",
      "summary": "When the data in question is self-contained, or frequently changed, use convenient input. \"Convenient\" methods include inline editing, and always-visible forms for adding new records."
    },
  "disclosed-input":
    {
      "id": "disclosedInput",
      "title": "Disclosed Input",
      "summary": "<p>When the data in question is complex, or when multiple related items must be changed at one time, use disclosed input. With disclosed input and editing, the user interface to edit, or create new records, is hidden until requested. \"Disclosed\" methods include putting a list or form into edit more, or an \"add new\" button to display the fields necessary to create new records. A disclosed interface is also appropriate when editing the data is an uncommon occurrence.</p>
      <p>In general, viewing and editing data should happen within the same interface. The exceptions are complex multi-step forms, or data that merits an entirely focused, distraction-free view. In such cases, it may be appropriate to perform input/editing in a focus-stealing modal view.</p>"
    }
}
