{
  "left-panel":
    {
      "bgImg": "https://source.unsplash.com/random/1200x4800",
      "bgImgAlt": "Random UnSplash Img",
      "headerLink": "/apollo",
      "siteSection": "The Design of Apollo",
      "pageTitle": "Destroying Data",
      "pageSummary": "Increase confidence and reduce fear: making data safe for the user.",
      "prevLink": "../changing-data",
      "prevPage": "Changing Data",
      "nextLink": "../empty-states",
      "nextPage": "Empty States"
    },
  "detailed-content-header" :
    {
      "headline": "Destroying Data",
      "tagline": "Make the user feel safer",
      "summary": "People make mistakes. Sometimes they delete the wrong data. The best we can do is reduce the likelihood they are making a critical, irrevocable, mistake.
        <p>
          When designing an interface that deletes or destroys data, there are several principles to consider:
        </p>
        <ol>
          <li>We want the user to feel confident they won't accidentally destroy data that should not be destroyed.</li>
          <li>We want the user to feel confident they have actually destroyed data when that is their intention.</li>
          <li>We want to minimize annoyance when the user needs to delete a lot of data.</li>
        </ol>",
      "headerImg": "https://source.unsplash.com/random/219x325",
      "headerImgAlt": "Random Unsplash Img",
      "contentList": [
        {
          "id": "easeOfDeletion",
          "name": "Relative Ease of Deletion"
        },
        {
          "id": "reducingFear",
          "name": "Reducing Fear"
        },
        {
          "id": "reducingAnnoyance",
          "name": "Reducing Annoyance"
        }
      ]
    },
  "ease-of-deletion":
    {
      "id": "easeOfDeletion",
      "title": "Relative Ease of Deletion",
      "summary": "How should we indicate whether a record can be deleted? In general, the friction required for a user to destroy data should be commensurate with the consequences of accidentally deleting the data. Make it easy to destroy data that is transient or easy to replace, or when the primary goal of an interface is deletion. Require confirmation, conversely, if recreating the data is difficult or time-consuming, or if accidental deletion has serious consequences."
    },
  "reducing-fear":
    {
      "id": "reducingFear",
      "title": "Reducing Fear",
      "summary":
        "
        <p>There is a psychological aspect to designing a data-deletion scenario. To reduce a user’s fear of accidentally deleting the wrong data, consider the following questions about your user experience:</p>
        <ul>
          <li>Is there an opportunity to confirm or cancel the deletion?</li>
          <li>Is there an option to undo deletion?</li>
          <li>Does the data really need to be deleted? Would an archive option be better?</li>
        </ul>
        <p>Your design can also mitigate a user’s fear that data wasn't actually deleted:</p>
        <ul>
          <li>What messages are there to confirm the successful deletion of a record?</li>
          <li>How do we handle server-side inability to delete the record (for example, a system failure)?</li>
          <li>•	How do we handle server-side rejection of the deletion request for example, an authorization failure)?</li>
        </ul>
        "
    },
  "reducing-annoyance":
    {
      "id": "reducingAnnoyance",
      "title": "Reducing Annoyance",
      "summary":
        "
        <p>Unless the data is ephemeral or trivial to recreate, deletion should never be a single-click process: it should always require confirmation. Increasing the friction required to delete something reduces worry. The user doesn’t fear they will accidentally delete something.</p>
        <p>One way to design this type of interaction is to hide deletion from the default state of an interface, and require the user to take an action that makes deletion possible. This switches the application to a state where the specific goal of the interface is deletion, and the user must also confirm the deletion. Such an interaction draws a nice balance between friction and user confidence.</p>
        <p>However, you also want to reduce the user’s frustration and blind clicking when they need to perform multiple deletions (instead of making them click DELETE over and over again). To that end, wherever possible, make it easy to delete multiple items at once.</p>
        <p>For example, in a list view of Widgets, provide an action to “Edit” the list. When the user is in list editing mode, make it possible to select multiple Widgets and delete them together.</p>
        <p>For extra confirmation of particularly destructive actions — such as destroying significant data that cannot be restored — you can use a focus-stealing modal confirmation. Note that this is not appropriate in all cases, only when it is appropriate to interrupt the user's flow of action.</p>
        "
    },
  "modal-note":
    {
      "title": "Focus-Stealing Modal",
      "note": "<a href=\"http://design.imshealth.com/resources/interfaces/components/modal.html\" target='_blank' class=\"link\">Apollo Modal Component</a>"
    }
}
